In [2]:
import numpy as np

In [17]:
import pandas as pd
from numpy.random import randn

In [4]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array
d = {'a':10,'b':20,'c':30}

In [14]:
#Series Session
pd.Series(labels)
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
ser1 = pd.Series([1,2,3,4],['A','B','C','D'])

In [8]:
ser2 = pd.Series([2,4,5,8],['A','B','E','F'])

In [9]:
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [10]:
ser2

A    2
B    4
E    5
F    8
dtype: int64

In [11]:
ser1['A'] + ser2['B']

5

In [12]:
ser1 + ser2

A    3.0
B    6.0
C    NaN
D    NaN
E    NaN
F    NaN
dtype: float64

In [15]:
## Data Frames
np.random.seed(101)

In [18]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
#Column selection
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [21]:
##Every row and column are Pandas Series in DataFrame
type(df['W'])

pandas.core.series.Series

In [22]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [23]:
#Create new Column
df['new'] = df['W'] + df['Z']

In [24]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [25]:
##axis 1 when deleting column default value is 0
df.drop('new',axis =1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [29]:
##Remove permenanet
df.drop('new',axis=1 , inplace=True)

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df.drop('E',axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [33]:
df.shape

(5, 4)

In [34]:
## Row based selection - label names based selection
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [36]:
Integer based location
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df.loc['B','Y']

-0.8480769834036315

In [39]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [40]:
##Conditional operation on DatFrames = Filtered rows where column W is greater then zero
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df[['W','Y']] > 0

       W      Y
A   True   True
B   True  False
C  False   True
D   True  False
E   True   True

In [43]:
df[df[['W','Y']] > 0]

          W   X         Y   Z
A  2.706850 NaN  0.907969 NaN
B  0.651118 NaN       NaN NaN
C       NaN NaN  0.528813 NaN
D  0.188695 NaN       NaN NaN
E  0.190794 NaN  2.605967 NaN

In [44]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df[df['W'] > 0][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [47]:
#Multiple conditional selection - And - &  , Or - 
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [50]:
newind = 'CA SA UP MP RJ'.split()

In [51]:
newind

['CA', 'SA', 'UP', 'MP', 'RJ']

In [52]:
df['state'] = newind

In [53]:
df

          W         X         Y         Z state
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    SA
C -2.018168  0.740122  0.528813 -0.589001    UP
D  0.188695 -0.758872 -0.933237  0.955057    MP
E  0.190794  1.978757  2.605967  0.683509    RJ

In [54]:
df.set_index('state') #inplace operation has to set true

              W         X         Y         Z
state
CA     2.706850  0.628133  0.907969  0.503826
SA     0.651118 -0.319318 -0.848077  0.605965
UP    -2.018168  0.740122  0.528813 -0.589001
MP     0.188695 -0.758872 -0.933237  0.955057
RJ     0.190794  1.978757  2.605967  0.683509

In [55]:
df

          W         X         Y         Z state
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    SA
C -2.018168  0.740122  0.528813 -0.589001    UP
D  0.188695 -0.758872 -0.933237  0.955057    MP
E  0.190794  1.978757  2.605967  0.683509    RJ